; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v5 ?v11)
             (pred_5 ?v13 ?v12)
             (pred_11 ?v5 ?v12)
             (pred_4 ?v3 ?v5 )
	     (pred_9 ?v5)
             (pred_8 ?v10)
             (pred_6 ?v13)
             (pred_7 ?v12)
             (pred_2 ?v5)
             (pred_10 ?v13)
             (pred_3 ?v5)
             (pred_1 ))



(:action op_4
:parameters (?v7 ?v2 ?v4 ?v1)
:precondition (and (pred_8 ?v7) (pred_8 ?v2) (pred_6 ?v4) (pred_7 ?v1)
          (pred_12 ?v7 ?v2) (pred_5 ?v4 ?v1)
                   (pred_11 ?v2 ?v1) (pred_9 ?v7) 
                   (pred_2 ?v2) (pred_10 ?v4))
:effect (and  (pred_3 ?v2) (not (pred_2 ?v2))))


(:action op_3
:parameters (?v7 ?v9)
:precondition (and (pred_8 ?v7) (pred_8 ?v9)
               (pred_9 ?v7) (pred_12 ?v7 ?v9) (pred_3 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v7))))

(:action op_5
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_6 ?v4) 
                  (pred_9 ?v7) (pred_4 ?v4 ?v7) (pred_1 ))
:effect (and (pred_10 ?v4)
   (not (pred_4 ?v4 ?v7)) (not (pred_1 ))))


(:action op_2
:parameters (?v7 ?v8 ?v6)
:precondition (and (pred_8 ?v7) (pred_6 ?v8) (pred_6 ?v6)
                  (pred_9 ?v7) (pred_10 ?v6) (pred_4 ?v8 ?v7))
:effect (and (pred_10 ?v8) (pred_4 ?v6 ?v7)
        (not (pred_10 ?v6)) (not (pred_4 ?v8 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_6 ?v4) 
                  (pred_9 ?v7) (pred_10 ?v4))
:effect (and (pred_1 ) (pred_4 ?v4 ?v7) (not (pred_10 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_19 obj_12 obj_17 obj_09 obj_10 obj_08 obj_13 obj_06 obj_20 obj_21 obj_15 obj_03 obj_02 obj_18 obj_16
    obj_04 obj_14
    obj_07 obj_05 obj_01
    )

    (:init
       (pred_1)

       (pred_8 obj_11)
       (pred_8 obj_19)
       (pred_8 obj_12)
       (pred_8 obj_17)
       (pred_8 obj_09)
       (pred_8 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_13)
       (pred_8 obj_06)
       (pred_8 obj_20)
       (pred_8 obj_21)
       (pred_8 obj_15)
       (pred_8 obj_03)
       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_7 obj_04)
       (pred_7 obj_14)
       (pred_6 obj_07)
       (pred_6 obj_05)
       (pred_6 obj_01)

       (pred_12 obj_11 obj_09)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_19 obj_12)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_12 obj_08)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_19)
       (pred_12 obj_17 obj_13)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_09 obj_06)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_10 obj_20)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_19)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_08 obj_21)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_08 obj_12)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_17)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_06 obj_03)
       (pred_12 obj_06 obj_20)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_20 obj_21)
       (pred_12 obj_20 obj_10)
       (pred_12 obj_20 obj_06)
       (pred_12 obj_21 obj_18)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_08)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_03 obj_06)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_18 obj_16)
       (pred_12 obj_18 obj_21)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_16 obj_18)
       (pred_2 obj_03)
       (pred_2 obj_17)
       (pred_2 obj_19)
       (pred_11  obj_03 obj_04)
       (pred_11  obj_17 obj_14)
       (pred_11  obj_19 obj_14)
       (pred_3 obj_11)
       (pred_3 obj_12)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_06)
       (pred_3 obj_20)
       (pred_3 obj_21)
       (pred_3 obj_15)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_16)

       (pred_5  obj_07 obj_04)
       (pred_5  obj_05 obj_14)
       (pred_5  obj_01 obj_14)
       (pred_4 obj_07 obj_18)
       (pred_4 obj_05 obj_10)
       (pred_4 obj_01 obj_09)
       (pred_9 obj_20)
    )

    (:goal (and
       (pred_4 obj_05 obj_13)
    ))
(:constraints
  (always (not (pred_9 obj_08)))
)
)

; plan
1. (op_3 obj_20 obj_10)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_10)
   goals met: 0 of 1
2. (op_5 obj_10 obj_05)
   deleted: (pred_4 obj_05 obj_10) (pred_1)
   added: (pred_10 obj_05)
   goals met: 0 of 1
3. (op_3 obj_10 obj_20)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_20)
   goals met: 0 of 1
4. (op_3 obj_20 obj_21)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_21)
   goals met: 0 of 1
5. (op_3 obj_21 obj_15)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_15)
   goals met: 0 of 1
6. (op_3 obj_15 obj_13)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_13)
   goals met: 0 of 1
7. (op_1 obj_13 obj_05)
   deleted: (pred_10 obj_05)
   added: (pred_1) (pred_4 obj_05 obj_13)
   goals met: 1 of 1
